Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SectionViewLabelMarkPropertyElementTypes
The SectionViewLabelMarkPropertyElementTypes class represents the available property element types for section view label marks.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SectionViewLabelMarkPropertyElementTypes.SectionName
Returns the section name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SectionViewLabelMarkPropertyElementTypes.Scale
Returns the scale property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SectionViewLabelMarkPropertyElementTypes.DrawingName
Returns the drawing name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SectionViewLabelMarkPropertyElementTypes.SourceDrawingName
Returns the source drawing name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SectionViewLabelMarkPropertyElementTypes.SourceDrawingNameWhenMoved
Returns the source drawing name when moved property element type.
Returns: The requested property element type.